Backrooms/src/Documents/ЗаявкаНаМероприятие/ЗаявкаНаМероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаМероприятие</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйОрганизатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеМероприятия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКЗаявке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
</mdclass:Document>

Backrooms/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
</mdclass:Enum>

Backrooms/src/Documents/ЗаявкаНаМероприятие/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ИспользоватьФильтрПриИзменении(Элемент)
	ФильтрПоСтатусуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФильтрПоСтатусуПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("Фильтр", ИспользоватьФильтр);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусЗаявки", ФильтрПоСтатусу);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоСтатусуПриИзменении(Элемент)
	ФильтрПоСтатусуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.ИспользоватьФильтр = Истина;
	ЭтотОбъект.ФильтрПоСтатусу = Перечисления.СтатусыЗаявок.НаРассмотрении;
	
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация", ПараметрыСеанса.Пользователь.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("Фильтр", ИспользоватьФильтр);
	Список.Параметры.УстановитьЗначениеПараметра("СтатусЗаявки", ФильтрПоСтатусу);
КонецПроцедуры
